InformationRegisters/IT_НастройкиПрограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>IT_НастройкиПрограммы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/IT_НастройкиПрограммы/Ext/ManagerModule.bsl
Функция ПолучитьДополнительнуюНастройку(Настройка, Сообщать = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Настройка) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПрограммы.Значение КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.IT_НастройкиПрограммы КАК НастройкиПрограммы
	|ГДЕ
	|	НастройкиПрограммы.Настройка = &Настройка";
	
	Запрос.УстановитьПараметр("Настройка", Настройка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Если Сообщать Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена настройка: " + Настройка);
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ЗначениеВозврата = ВыборкаДетальныеЗаписи.ЗначениеНастройки;
	
	ЗначениеВозврата = ЗначениеВозврата.Получить();
	
	Возврат ЗначениеВозврата;
	
КонецФункции
